# ----------------------------------------------------------------------------
#  导入库文件
# ----------------------------------------------------------------------------
from launch import LaunchDescription 
from launch_ros.actions import Node

# ----------------------------------------------------------------------------
#  启动函数
# ----------------------------------------------------------------------------
def generate_launch_description():

    # -------------------------------
    #  USB CDC 节点 : usb_cdc_node 负责串口通信，通常桥接 USB CDC 设备与 ROS 话题
    # --------------------------------------------------------------
    node_usb_cdc = Node(
        package="usb_cdc",
        executable="usb_cdc_node",
        output="screen",
    )

    # -------------------------------
    #  LaunchDescription 组装
    # -------------------------------
    return LaunchDescription([
        node_usb_cdc,
    ])
